IlleniumDillon/MM32LLD/MM32/Sfr/MM32_ADCReg.h
#ifndef _MM32_ADCREG_H_
#define _MM32_ADCREG_H_

#include "MM32_RegBase.h"

#include "MM32_ADCRegDef.h"

#define MOUDLE_ADC1		((MM32_ADC*)ADC1_BASE)

#define MOUDLE_ADC2		((MM32_ADC*)ADC2_BASE)

#define MOUDLE_ADC3		((MM32_ADC*)ADC3_BASE)

#define ADC1_ADDATA		((MM32_ADC_ADDATA*)(ADC1_BASE+0x00))

#define ADC1_ADCFG		((MM32_ADC_ADCFG*)(ADC1_BASE+0x04))

#define ADC1_ADCR		((MM32_ADC_ADCR*)(ADC1_BASE+0x08))

#define ADC1_ADCHS		((MM32_ADC_ADCHS*)(ADC1_BASE+0x0C))

#define ADC1_ADCMPR		((MM32_ADC_ADCMPR*)(ADC1_BASE+0x10))

#define ADC1_ADSTA		((MM32_ADC_ADSTA*)(ADC1_BASE+0x14))

#define ADC1_ADDR0		((MM32_ADC_ADDR0*)(ADC1_BASE+0x18))

#define ADC1_ADDR1		((MM32_ADC_ADDR1*)(ADC1_BASE+0x1C))

#define ADC1_ADDR2		((MM32_ADC_ADDR2*)(ADC1_BASE+0x20))

#define ADC1_ADDR3		((MM32_ADC_ADDR3*)(ADC1_BASE+0x24))

#define ADC1_ADDR4		((MM32_ADC_ADDR4*)(ADC1_BASE+0x28))

#define ADC1_ADDR5		((MM32_ADC_ADDR5*)(ADC1_BASE+0x2C))

#define ADC1_ADDR6		((MM32_ADC_ADDR6*)(ADC1_BASE+0x30))

#define ADC1_ADDR7		((MM32_ADC_ADDR7*)(ADC1_BASE+0x34))

#define ADC1_ADDR8		((MM32_ADC_ADDR8*)(ADC1_BASE+0x38))

#define ADC1_ADDR9		((MM32_ADC_ADDR9*)(ADC1_BASE+0x3C))

#define ADC1_ADDR10		((MM32_ADC_ADDR10*)(ADC1_BASE+0x40))

#define ADC1_ADDR11		((MM32_ADC_ADDR11*)(ADC1_BASE+0x44))

#define ADC1_ADDR12		((MM32_ADC_ADDR12*)(ADC1_BASE+0x48))

#define ADC1_ADDR13		((MM32_ADC_ADDR13*)(ADC1_BASE+0x4C))

#define ADC1_ADDR14		((MM32_ADC_ADDR14*)(ADC1_BASE+0x50))

#define ADC1_ADDR15		((MM32_ADC_ADDR15*)(ADC1_BASE+0x54))

#define ADC1_ADSTA_EXT		((MM32_ADC_ADSTA_EXT*)(ADC1_BASE+0x58))

#define ADC1_CHANY0		((MM32_ADC_CHANY0*)(ADC1_BASE+0x5C))

#define ADC1_CHANY1		((MM32_ADC_CHANY1*)(ADC1_BASE+0x60))

#define ADC1_ANY_CFG		((MM32_ADC_ANY_CFG*)(ADC1_BASE+0x64))

#define ADC1_ANY_CR		((MM32_ADC_ANY_CR*)(ADC1_BASE+0x68))

#define ADC1_SMPR1		((MM32_ADC_SMPR1*)(ADC1_BASE+0x70))

#define ADC1_SMPR2		((MM32_ADC_SMPR2*)(ADC1_BASE+0x74))

#define ADC1_JOFR0		((MM32_ADC_JOFR0*)(ADC1_BASE+0x7C))

#define ADC1_JOFR1		((MM32_ADC_JOFR1*)(ADC1_BASE+0x80))

#define ADC1_JOFR2		((MM32_ADC_JOFR2*)(ADC1_BASE+0x84))

#define ADC1_JOFR3		((MM32_ADC_JOFR3*)(ADC1_BASE+0x88))

#define ADC1_JSQR		((MM32_ADC_JSQR*)(ADC1_BASE+0x8C))

#define ADC1_JADDATA		((MM32_ADC_JADDATA*)(ADC1_BASE+0x90))

#define ADC1_JDR0		((MM32_ADC_JDR0*)(ADC1_BASE+0xB0))

#define ADC1_JDR1		((MM32_ADC_JDR1*)(ADC1_BASE+0xB4))

#define ADC1_JDR2		((MM32_ADC_JDR2*)(ADC1_BASE+0xB8))

#define ADC1_JDR3		((MM32_ADC_JDR3*)(ADC1_BASE+0xBC))

#define ADC2_ADDATA		((MM32_ADC_ADDATA*)(ADC2_BASE+0x00))

#define ADC2_ADCFG		((MM32_ADC_ADCFG*)(ADC2_BASE+0x04))

#define ADC2_ADCR		((MM32_ADC_ADCR*)(ADC2_BASE+0x08))

#define ADC2_ADCHS		((MM32_ADC_ADCHS*)(ADC2_BASE+0x0C))

#define ADC2_ADCMPR		((MM32_ADC_ADCMPR*)(ADC2_BASE+0x10))

#define ADC2_ADSTA		((MM32_ADC_ADSTA*)(ADC2_BASE+0x14))

#define ADC2_ADDR0		((MM32_ADC_ADDR0*)(ADC2_BASE+0x18))

#define ADC2_ADDR1		((MM32_ADC_ADDR1*)(ADC2_BASE+0x1C))

#define ADC2_ADDR2		((MM32_ADC_ADDR2*)(ADC2_BASE+0x20))

#define ADC2_ADDR3		((MM32_ADC_ADDR3*)(ADC2_BASE+0x24))

#define ADC2_ADDR4		((MM32_ADC_ADDR4*)(ADC2_BASE+0x28))

#define ADC2_ADDR5		((MM32_ADC_ADDR5*)(ADC2_BASE+0x2C))

#define ADC2_ADDR6		((MM32_ADC_ADDR6*)(ADC2_BASE+0x30))

#define ADC2_ADDR7		((MM32_ADC_ADDR7*)(ADC2_BASE+0x34))

#define ADC2_ADDR8		((MM32_ADC_ADDR8*)(ADC2_BASE+0x38))

#define ADC2_ADDR9		((MM32_ADC_ADDR9*)(ADC2_BASE+0x3C))

#define ADC2_ADDR10		((MM32_ADC_ADDR10*)(ADC2_BASE+0x40))

#define ADC2_ADDR11		((MM32_ADC_ADDR11*)(ADC2_BASE+0x44))

#define ADC2_ADDR12		((MM32_ADC_ADDR12*)(ADC2_BASE+0x48))

#define ADC2_ADDR13		((MM32_ADC_ADDR13*)(ADC2_BASE+0x4C))

#define ADC2_ADDR14		((MM32_ADC_ADDR14*)(ADC2_BASE+0x50))

#define ADC2_ADDR15		((MM32_ADC_ADDR15*)(ADC2_BASE+0x54))

#define ADC2_ADSTA_EXT		((MM32_ADC_ADSTA_EXT*)(ADC2_BASE+0x58))

#define ADC2_CHANY0		((MM32_ADC_CHANY0*)(ADC2_BASE+0x5C))

#define ADC2_CHANY1		((MM32_ADC_CHANY1*)(ADC2_BASE+0x60))

#define ADC2_ANY_CFG		((MM32_ADC_ANY_CFG*)(ADC2_BASE+0x64))

#define ADC2_ANY_CR		((MM32_ADC_ANY_CR*)(ADC2_BASE+0x68))

#define ADC2_SMPR1		((MM32_ADC_SMPR1*)(ADC2_BASE+0x70))

#define ADC2_SMPR2		((MM32_ADC_SMPR2*)(ADC2_BASE+0x74))

#define ADC2_JOFR0		((MM32_ADC_JOFR0*)(ADC2_BASE+0x7C))

#define ADC2_JOFR1		((MM32_ADC_JOFR1*)(ADC2_BASE+0x80))

#define ADC2_JOFR2		((MM32_ADC_JOFR2*)(ADC2_BASE+0x84))

#define ADC2_JOFR3		((MM32_ADC_JOFR3*)(ADC2_BASE+0x88))

#define ADC2_JSQR		((MM32_ADC_JSQR*)(ADC2_BASE+0x8C))

#define ADC2_JADDATA		((MM32_ADC_JADDATA*)(ADC2_BASE+0x90))

#define ADC2_JDR0		((MM32_ADC_JDR0*)(ADC2_BASE+0xB0))

#define ADC2_JDR1		((MM32_ADC_JDR1*)(ADC2_BASE+0xB4))

#define ADC2_JDR2		((MM32_ADC_JDR2*)(ADC2_BASE+0xB8))

#define ADC2_JDR3		((MM32_ADC_JDR3*)(ADC2_BASE+0xBC))

#define ADC3_ADDATA		((MM32_ADC_ADDATA*)(ADC3_BASE+0x00))

#define ADC3_ADCFG		((MM32_ADC_ADCFG*)(ADC3_BASE+0x04))

#define ADC3_ADCR		((MM32_ADC_ADCR*)(ADC3_BASE+0x08))

#define ADC3_ADCHS		((MM32_ADC_ADCHS*)(ADC3_BASE+0x0C))

#define ADC3_ADCMPR		((MM32_ADC_ADCMPR*)(ADC3_BASE+0x10))

#define ADC3_ADSTA		((MM32_ADC_ADSTA*)(ADC3_BASE+0x14))

#define ADC3_ADDR0		((MM32_ADC_ADDR0*)(ADC3_BASE+0x18))

#define ADC3_ADDR1		((MM32_ADC_ADDR1*)(ADC3_BASE+0x1C))

#define ADC3_ADDR2		((MM32_ADC_ADDR2*)(ADC3_BASE+0x20))

#define ADC3_ADDR3		((MM32_ADC_ADDR3*)(ADC3_BASE+0x24))

#define ADC3_ADDR4		((MM32_ADC_ADDR4*)(ADC3_BASE+0x28))

#define ADC3_ADDR5		((MM32_ADC_ADDR5*)(ADC3_BASE+0x2C))

#define ADC3_ADDR6		((MM32_ADC_ADDR6*)(ADC3_BASE+0x30))

#define ADC3_ADDR7		((MM32_ADC_ADDR7*)(ADC3_BASE+0x34))

#define ADC3_ADDR8		((MM32_ADC_ADDR8*)(ADC3_BASE+0x38))

#define ADC3_ADDR9		((MM32_ADC_ADDR9*)(ADC3_BASE+0x3C))

#define ADC3_ADDR10		((MM32_ADC_ADDR10*)(ADC3_BASE+0x40))

#define ADC3_ADDR11		((MM32_ADC_ADDR11*)(ADC3_BASE+0x44))

#define ADC3_ADDR12		((MM32_ADC_ADDR12*)(ADC3_BASE+0x48))

#define ADC3_ADDR13		((MM32_ADC_ADDR13*)(ADC3_BASE+0x4C))

#define ADC3_ADDR14		((MM32_ADC_ADDR14*)(ADC3_BASE+0x50))

#define ADC3_ADDR15		((MM32_ADC_ADDR15*)(ADC3_BASE+0x54))

#define ADC3_ADSTA_EXT		((MM32_ADC_ADSTA_EXT*)(ADC3_BASE+0x58))

#define ADC3_CHANY0		((MM32_ADC_CHANY0*)(ADC3_BASE+0x5C))

#define ADC3_CHANY1		((MM32_ADC_CHANY1*)(ADC3_BASE+0x60))

#define ADC3_ANY_CFG		((MM32_ADC_ANY_CFG*)(ADC3_BASE+0x64))

#define ADC3_ANY_CR		((MM32_ADC_ANY_CR*)(ADC3_BASE+0x68))

#define ADC3_SMPR1		((MM32_ADC_SMPR1*)(ADC3_BASE+0x70))

#define ADC3_SMPR2		((MM32_ADC_SMPR2*)(ADC3_BASE+0x74))

#define ADC3_JOFR0		((MM32_ADC_JOFR0*)(ADC3_BASE+0x7C))

#define ADC3_JOFR1		((MM32_ADC_JOFR1*)(ADC3_BASE+0x80))

#define ADC3_JOFR2		((MM32_ADC_JOFR2*)(ADC3_BASE+0x84))

#define ADC3_JOFR3		((MM32_ADC_JOFR3*)(ADC3_BASE+0x88))

#define ADC3_JSQR		((MM32_ADC_JSQR*)(ADC3_BASE+0x8C))

#define ADC3_JADDATA		((MM32_ADC_JADDATA*)(ADC3_BASE+0x90))

#define ADC3_JDR0		((MM32_ADC_JDR0*)(ADC3_BASE+0xB0))

#define ADC3_JDR1		((MM32_ADC_JDR1*)(ADC3_BASE+0xB4))

#define ADC3_JDR2		((MM32_ADC_JDR2*)(ADC3_BASE+0xB8))

#define ADC3_JDR3		((MM32_ADC_JDR3*)(ADC3_BASE+0xBC))

#endif